site.org
#+title: Random bits and pieces
#+subtitle: ...about programming, languages, tools, FLOSS software...
#+author: Igor Dejanović
#+hugo_base_dir: .
#+hugo_section: /
#+options: creator:t author:nil

** Implementing Martin Fowler's state machine DSL in textX :dsl:textX:
:PROPERTIES:
:EXPORT_FILE_NAME: implementing-martin-fowler-state-machine-dsl-in-textx
:EXPORT_DATE: 2016-05-06
:END:

Well, you know what they say:

#+begin_quote
You aren't making a DSL tool if you haven't
implemented [[http://www.martinfowler.com/aboutMe.html][Martin Fowler's]] State Machine language using your tool yet ;)
#+end_quote


This is a well known DSL example from his book [[http://www.martinfowler.com/books/dsl.html][Domain-Specific Languages]]. If you
are doing stuff in the field of DSLs you should definitely read this book. There
is an [[http://www.informit.com/articles/article.aspx?p=1592379&seqNum=1][excerpt from the book]] available on-line so I advise you to read it before
watching the video below.

Another book which I also highly recommend is [[http://dslbook.org/][DSL Engineering: Designing,
Implementing and Using Domain-Specific Languages]] by [[http://voelter.de/about][Markus Völter]]. Also an
excelent read, although oriented more towards modeling languages with graphical
syntaxes (a.k.a. Domain-Specific Modeling), is the book [[http://dsmbook.com/][Domain-Specific
Modeling: Enabling Full Code Generation]] by [[http://www.metacase.com/stevek.html][Steven Kelly]] and [[http://www.metacase.com/jpt.html][Juha-Pekka
Tolvanen]].

In the video bellow I am explaining the implementation of the Martin Fowler's
State Machine language in [[https://github.com/igordejanovic/textX/][textX]] by:

- Specifying the grammar of the language
- Creating source code generator by generating a nice /dot/ state charts
- Creating model interpreter in Python

This tutorial is a good overview of textX workflow and capabilities but if you
want to see basic introduction together with installation and the first steps I
suggest you to watch [[http://igordejanovic.net/2016/05/04/video-introduction-to-textx/][video introduction to textX]] first.

Full source code presented in the video is available at [[https://github.com/igordejanovic/textX/tree/master/examples/StateMachine][the project GitHub
repository]]. I hope you will enjoy watching this video as much I enjoyed
playing with this little language.

#+md: {{< youtube HI14jk0JIR0 >}}

